{
    "count": 21,
    "compilation": [
        [
            {
                "character": "Kyle",
                "line": "Yeah. Here you go. \n"
            },
            {
                "character": "Stan",
                "line": "Boy, I'm sure glad that's over with.\n"
            },
            {
                "character": "Butters",
                "line": "Me too!\n"
            },
            {
                "character": "Kyle",
                "line": "Yeah, but you know, I learned something today. We thought we could make money on the Internet. But, while the Internet is new and exciting for creative people, it hasn't matured as a distribution mechanism to the extent that one should trade real and immediate opportunities for income for the promise of future online revenue. It will be a few years before digital distribution of media on the Internet can be monetized to the extent that necessitates content producers to forgo their fair value in more traditional media.\n"
            },
            {
                "character": "Stan",
                "line": "...Yeah.\n"
            },
            {
                "character": "Stephen Abootman",
                "line": "Yeah, we did it! Celebrate, everyone! Woohoo! \n"
            }
        ],
        [
            {
                "character": "Scott Tenorman",
                "line": "I'll be back, Super Best Friends! \n"
            },
            {
                "character": "Jesus",
                "line": "Who's the creepy ginger kid?\n"
            },
            {
                "character": "Tom Cruise",
                "line": "Reiner, you said the goo machine would work! But I got made fun of!\n"
            },
            {
                "character": "Kyle",
                "line": "That's because there is no goo, Mr. Cruise. You see, I learned something today. Throughout this whole ordeal, we've all wanted to show things that we weren't allowed to show. But it wasn't because of some magic goo. It was because of the magical power of threatening people with violence. That's obviously the only true power. If there's anything we've all learned, it's that terrorizing people works.\n"
            },
            {
                "character": "Jesus",
                "line": "That's right. Don't you see, gingers?  If you don't want to be made fun of anymore, all you need are guns and bombs to get people to stop.\n"
            },
            {
                "character": "Santa",
                "line": "That's right, friends. All you need to do is instill fear and be willing to hurt people and you can get whatever you want. The only true power is violence.\n"
            }
        ],
        [
            {
                "character": "Mr. Hat",
                "line": "You can say that again, Mr. Garrison.\n"
            },
            {
                "character": "Kyle",
                "line": "Come down here, you stinking aliens!  Uh, uh...\n"
            },
            {
                "character": "Stan",
                "line": "Go on, Kyle, ask 'em for your little brother back.\n"
            },
            {
                "character": "Kyle",
                "line": "Vi, Visitors, this morning you took my little brother, Ike. He's the little freckled kid that looks like a football. At first, I was happy you took him away. But I've learned something today. That having a little brother... is a pretty special thing.\n"
            },
            {
                "character": "Stan",
                "line": "Yeah.\n"
            },
            {
                "character": "Kyle",
                "line": "Ah, heck, Mr. Visitors, I'm just a kid all alone in this crazy world, but if you could find it in your hearts or whatever you have, to give my brother back to me, it sure would make my life brighter again.\n"
            }
        ],
        [
            {
                "character": "Kyle",
                "line": "Yeah, he was too young to be taken from us.\n"
            },
            {
                "character": "Stan",
                "line": "Dude, you're the one who cut him in half with a chain saw.\n"
            },
            {
                "character": "Cartman",
                "line": "Let, let us remember the good times, Kenny would have wanted it that way. \n"
            },
            {
                "character": "Stan",
                "line": "You know, I've really learned something today. Halloween isn't about costumes, or candy. It's about being good to one another, and giving and loving.\n"
            },
            {
                "character": "Kyle",
                "line": "...No, dude, that's Christmas.\n"
            },
            {
                "character": "Stan",
                "line": "Oh, then, what's Halloween about?\n"
            }
        ],
        [
            {
                "character": "Agent 1",
                "line": "There you are. Are you ready to go home now?\n"
            },
            {
                "character": "Stan",
                "line": "Wow, it sucks he has to leave.\n"
            },
            {
                "character": "Kyle",
                "line": "Yeah, I like him a lot more than Cartman.\n"
            },
            {
                "character": "Stan",
                "line": "You know, I think I've learned something today. It's really easy not to think of images on TV as real people.  But they are. That's why it's easy to ignore those commercials, but, people on TV are just as real as you or I.\n"
            },
            {
                "character": "Kyle",
                "line": "Yeah.  And that means that McGyver is a real person too.\n"
            },
            {
                "character": "Red Cross Chick",
                "line": "We're terribly sorry about the mix-up little boy. We'll get you back home immediately.\n"
            }
        ],
        [
            {
                "character": "Mr. Hankey",
                "line": "Well, I've got a loong night ahead of me.  Bye-bye and Merry Christmas \n"
            },
            {
                "character": "Cartman",
                "line": "Good-bye Mr. Hankey!  Bring me lots of presents!  I always believed in you!\n"
            },
            {
                "character": "Santa",
                "line": "Howdy-ho ho ho!\n"
            },
            {
                "character": "Stan",
                "line": "You know, I learned something today.  I learned that Jewish people are okay.  And that...Channukah can be cool, too.\n"
            },
            {
                "character": "Kyle",
                "line": "Yeah... You know, it seems like something's still not right. \n"
            },
            {
                "character": "Cartman",
                "line": "Yeah, something feels...unfinished \n"
            }
        ],
        [
            {
                "character": "Stan",
                "line": "Go to hell, Cartman!\n"
            },
            {
                "character": "Kyle",
                "line": "Well, that whole experience sure did suck.\n"
            },
            {
                "character": "Stan",
                "line": "Yeah. I'm sure glad that's over with.\n"
            },
            {
                "character": "Kyle",
                "line": "But you know, I've learned something today. I've learned that people who want power, a lot of power, always... end up dead.\n"
            },
            {
                "character": "Stan",
                "line": "Yeah.\n"
            },
            {
                "character": "Cartman",
                "line": "Yeah, and I've learned something, too. Robert Smith kicks ass!  Oh no! She's back!\n"
            }
        ],
        [
            {
                "character": "Ike",
                "line": "Ouch. Amuhbuhbuhbuh.  Cookie Monster.\n"
            },
            {
                "character": "Kyle",
                "line": "Ike, you're okay. \n"
            },
            {
                "character": "Stan",
                "line": "Whoa, dude, I guess having a bris isn't all that bad.\n"
            },
            {
                "character": "Kyle",
                "line": "Yeah. You know, I've learned something today. Family isn't about whose blood you have, it's about who you care about.\n"
            },
            {
                "character": "Stan",
                "line": "Yeah.\n"
            },
            {
                "character": "Kyle",
                "line": "And that's why I feel like you guys are more than just friends. You're my family.  Except for Cartman.\n"
            }
        ],
        [
            {
                "character": "Butters",
                "line": "Uhuh oh uh, uh hooray, then!\n"
            },
            {
                "character": "Pip",
                "line": "There. Angels, I must say I think we did a smashing job.\n"
            },
            {
                "character": "Butters",
                "line": "Uh we, we sure did. Why, we put the fear of God in those ATF sons of guns, I can tell ya.\n"
            },
            {
                "character": "Stan",
                "line": "But you know, I learned something today. I used to call you guys Melvins. But you're just kids, like me. We separate you in school because you talk different and you study too hard, but we've proven tonight that we can all get along.\n"
            },
            {
                "character": "Butters",
                "line": "Uh, so you mean we can stay friends, Stan? Wouldn't that be swell, huh?\n"
            },
            {
                "character": "Kyle",
                "line": "Dude! I'm glad to see you. You would not believe the night I had.\n"
            }
        ],
        [
            {
                "character": "Kyle",
                "line": "Kenny! \n"
            },
            {
                "character": "Elder Harris",
                "line": "That blow to his head must have killed him.\n"
            },
            {
                "character": "Elder Carn",
                "line": "He saved us. He saved all the Jews.\n"
            },
            {
                "character": "Kyle",
                "line": "You know, I think we all learned something today. It's fine to have your own beliefs and your own traditions, but as soon as you start excluding people from your ways, only because of their race, you become separatists. And being a separatist sucks ass.\n"
            },
            {
                "character": "Elder Harris",
                "line": "We've learned a lot from you and your great friend, Kenny.\n"
            },
            {
                "character": "Moses",
                "line": "Every year we shall gather here in this special place and bring Kenny tidings of soap sculptures and macaroni pictures.\n"
            }
        ],
        [
            {
                "character": "Kyle",
                "line": "What?\n"
            },
            {
                "character": "Cartman",
                "line": "Yeah, dude, that's way over. \n"
            },
            {
                "character": "Kyle",
                "line": "Dude, you're just jealous because I'm Chinpoko Master!\n"
            },
            {
                "character": "Stan",
                "line": "No, Kyle. You see, we learned something today. This whole Chinpokomon thing happened because we all followed the group. We only liked Chinpokomon because everyone else did. And look at the damage it caused.\n"
            },
            {
                "character": "Kyle",
                "line": "So now I should stop liking Chinpokoman because you all don't?\n"
            },
            {
                "character": "Stan",
                "line": "...Ye-eah.\n"
            }
        ],
        [
            {
                "character": "Cartman",
                "line": "No! What about the Confederasuh?! What about freedom?!\n"
            },
            {
                "character": "Stan",
                "line": "Haha! You lose, fatass!\n"
            },
            {
                "character": "Cartman",
                "line": "God, I hate you guys!\n"
            },
            {
                "character": "Kyle",
                "line": "Yeah, but you know? I think you've learned something today. You've learned that you can't rewrite history.  You see, history is forever,  and everything happens for a reason.  Sure, you can try and change the past, but usually you kno-\n"
            },
            {
                "character": "Stan",
                "line": "Where are you going?\n"
            },
            {
                "character": "Cartman",
                "line": "This isn't over! Oh no! Oh no, not by a long shot! \n"
            }
        ],
        [
            {
                "character": "Yoko Ono",
                "line": "Wery well?! Wery well?! You're gonna be on Ricki Lake, I tell you again! Look at ad a bah godda circada she doin wery well?!\n"
            },
            {
                "character": "Mr. Mackey",
                "line": "Alright, come on, everybody. We've got a long bus ride back to Colorado, m'kay? \n"
            },
            {
                "character": "Kyle",
                "line": "Well, that whole experience sure did suck.\n"
            },
            {
                "character": "Stan",
                "line": "Yeah, but you know? I learned something today. We were so worried about how cool we looked to those New Yorker kids that we forgot: we're already totally cool, even if we don't know what queef means. \n"
            },
            {
                "character": "Mr. Mackey",
                "line": "Uh, queef is a vaginal expulsion of gas, m'kay. \n"
            },
            {
                "character": "Kyle",
                "line": "Huh?\n"
            }
        ],
        [
            {
                "character": "Loogie",
                "line": "Yeah. I kinda wanted to play in the flag football team this year anyways.\n"
            },
            {
                "character": "Stan",
                "line": "So you're not gonna hurt us or nothin'?\n"
            },
            {
                "character": "Loogie",
                "line": "Naah. In a way, I'm just glad the whole thing's over with.\n"
            },
            {
                "character": "Kyle",
                "line": "Yeah. But you know, I've learned something today. You see, the basis of all reasoning is the mind's awareness of itself. What we think, the external objects we perceive, are all like actors that come on and off stage. But our consciousness, the stage itself, is always present to us.\n"
            },
            {
                "character": "Cartman",
                "line": "...Tits.\n"
            },
            {
                "character": "Timmy",
                "line": "Timmy!\n"
            }
        ],
        [
            {
                "character": "Stan",
                "line": "Get off the stage, Phil Collins! We want Timmy!\n"
            },
            {
                "character": "Kyle",
                "line": "Yeah!\n"
            },
            {
                "character": "Phil Collins",
                "line": "You just wanna laugh at him.\n"
            },
            {
                "character": "Stan",
                "line": "No!  You see, we learned something today. Yeah, sure, we laughed at Timmy, but what's wrong with laughter? Just because we laugh at something doesn't mean we don't care about it. Timmy made us smile, and playing made Timmy smile, so where was the harm in that? The people that are wrong are the ones that think people like Timmy should be \"protected\" and kept out of the public's eye. The cool thing about Timmy being in a band was that he was in your face, and you had to deal with him, whether you laughed or cried, or felt nothing. That's why Timmy rules!\n"
            },
            {
                "character": "Kyle",
                "line": "Yeah! Tim-my! Tim-my!\n"
            },
            {
                "character": "Audience",
                "line": "Tim-my! Tim-my! Tim-my! Tim-my!\n"
            }
        ],
        [
            {
                "character": "Amber",
                "line": "Mom! They got it working!\n"
            },
            {
                "character": "Autumn",
                "line": "What's that? They got your father's penis workin' again? \n"
            },
            {
                "character": "Kyle",
                "line": "...We actually spoke—to the Brian Boitano.\n"
            },
            {
                "character": "Stan",
                "line": "Yeah. And you know? I think I've learned something today, it doesn't matter if you're Christian or Jewish or Atheist or Hindu.  Christmas still is about one very important thing.\n"
            },
            {
                "character": "Cartman",
                "line": "Yeah, ham.\n"
            },
            {
                "character": "Stan",
                "line": "No not ham!\n"
            }
        ],
        [
            {
                "character": "Cartman",
                "line": "What a stupid voice.\n"
            },
            {
                "character": "Kyle",
                "line": "It's okay. The curse has been lifted. \n"
            },
            {
                "character": "Stan",
                "line": "Yeah. We all gotta make sure it doesn't come back.\n"
            },
            {
                "character": "Kyle",
                "line": "You see, we've learned something today. Swearing can be fun, but doing it all the time causes a lot of problems.\n"
            },
            {
                "character": "Kyle",
                "line": "We're all saying the S-word too much! \n"
            },
            {
                "character": "Ike",
                "line": "Kyle.\n"
            }
        ],
        [
            {
                "character": "Stan",
                "line": "Kyle?  Dude, what are you doing here? Everybody's looking for you. Kyle?\n"
            },
            {
                "character": "Kyle",
                "line": "Do you know what happened to me this morning, Stan? This morning... I woke up and felt a sharp pain in my ass. I felt down there and, and found this... big sore lump. On my ass, Stan. I couldn't even sit down, so... I, I had to tell my mother, which, which was humiliating. She took me to the doctor, which was more humiliating, a- a- nd he told me. I-I have a hemorrhoid. It's like an infected blood vessel on your ass. I'm nine years old, and I have a hemorrhoid, Stan. I have a hemorrhoid, and, Cartman has his own theme park.\n"
            },
            {
                "character": "Stan",
                "line": "Kyle, I, I understand what you mean, but--\n"
            },
            {
                "character": "Kyle",
                "line": "Do you?! Do you, Stan?! Because all my life I was raised to believe in Jehovah! To believe that we should all behave a certain way and good things will come to us. I make mistakes, but every week I try to better myself. I'm always saying, \"You know, I learned something today...\" and what does this so-called God give me in return? A hemorrhoid. He doesn't make sense!  What is your logic?!  Ow. \n"
            },
            {
                "character": "Stan",
                "line": "Look. Cartman... he thinks he's gonna be happy because he has his own amusement park, but, he's gonna find out that without other people, the rides are totally lame. I mean, who could really have fun by themselves at a theme park? I'll bet he's sick of it already.\n"
            },
            {
                "character": "Cartman",
                "line": "Yyeessss! Yyeessss!  Awesome!  Ho ho!  Sweet!  Yes!  Folks, please keep your arms and legs inside the vehicle at all times, make sure your seat belts are fastened, and enjoy the Mine Shaft!  Yes!  Yes!  Oh, cool!  Oh, look how much fun I had!  Whoa! Heheheheh.  Ah! Heheh.  Whoa! Heh, heheh.  Woooo, Adventure Island! Check it out! Awesome!  Yoohoo! Yeh-hehess!  Yehess!  I'm so happy! I'm so happy..!\n"
            }
        ],
        [
            {
                "character": "Stan",
                "line": "Why?\n"
            },
            {
                "character": "Tuong Lu Kim",
                "line": "'Cause it has AIDS.  AIDS so funny! \n"
            },
            {
                "character": "Stan",
                "line": "Well, so much for our money.\n"
            },
            {
                "character": "Kyle",
                "line": "Yeah, but you know, I've learned something today. It would have been wrong to exploit Butters' weight loss. Because then lots of fat people would have believed it. And then gone and eaten a ton of Chinese food instead of dieting properly. They'd still be fat and, we'd be responsible for their shattered dreams.\n"
            },
            {
                "character": "Butters",
                "line": "Yeah, I don't like shattering fat peoples' dreams. Besides, I'd get grounded.  Oh, Jesus! I'm supposed to be grounded! \n"
            },
            {
                "character": "Butters",
                "line": "Huh. Huh, uh, uh.\n"
            }
        ],
        [
            {
                "character": "John Edward",
                "line": "Thank you.  Alright, asshole! I know you're here to try to throw me off, so go ahead. Give my your best shot!\n"
            },
            {
                "character": "Stan",
                "line": "No, I don't wanna talk to you. I wanna talk to the audience.\n"
            },
            {
                "character": "John Edward",
                "line": "Wah-why?\n"
            },
            {
                "character": "Stan",
                "line": "You see, I learned something today. At first I thought you were all stupid, listening to this douche's advice, but now I understand that you're all here because you're scared. You're scared of death and he offers you some kind of understanding. You all want to believe in it so much, I know you do. You find comfort in the thought that your loved ones are floating around trying to talk to you, but think about it: Is that really what you want? To just be floating around after you die, having to talk to this asshole?  We need to recognize this stuff for what it is: magic tricks. Because whatever's really going on in life and in death is much more amazing than this douche. \n"
            },
            {
                "character": "Audience Members",
                "line": "Yes. Right. Yeah. \n"
            },
            {
                "character": "Kyle",
                "line": "You're right, Stan. My Grandma isn't floating around, judging me and watching what I do. She's dead. Dead and gone forever.\n"
            }
        ],
        [
            {
                "character": "Rob Reiner",
                "line": "Yeah. When we kill the kid, people are gonna think it's because of second-hand smoke! And then these bastards are all gonna make money, and they know it! \n"
            },
            {
                "character": "Randy",
                "line": "Wha- what the hell is wrong with you? That's not right.\n"
            },
            {
                "character": "Rob Reiner",
                "line": "Oh, God-damnit, do I have to explain this again?! Smoking is bad, people! So if we have to be a little extreme to stop it, it's okay!\n"
            },
            {
                "character": "Kyle",
                "line": "No it isn't, you fat turd! Because, I've learned something today. You just hate-  See, I knew it.\n"
            },
            {
                "character": "Stan",
                "line": "Yup.\n"
            },
            {
                "character": "Kyle",
                "line": "You just hate smoking, so you use all your money and power to force others to think like you. And that's called fascism, you tubby asshole!\n"
            }
        ]
    ]
}