{
    "count": 8,
    "compilation": [
        [
            {
                "character": "Stan",
                "line": "Dude, Kenny is dead!  See?\n"
            },
            {
                "character": "Cartman",
                "line": "Shut up, you guys.\n"
            },
            {
                "character": "Kyle",
                "line": "He's dead, Cartman! \n"
            },
            {
                "character": "Cartman",
                "line": "God damn it, I didn't have an anal probe!  Screw you guys, I'm goin' home.\n"
            },
            {
                "character": "Kyle",
                "line": "Go on and go home, you fat chicken!\n"
            },
            {
                "character": "Cartman",
                "line": "Dildo!\n"
            }
        ],
        [
            {
                "character": "Stan",
                "line": "Dude, now that'd be like IMAX. \n"
            },
            {
                "character": "Cartman",
                "line": "Okay, that's enough fatass jokes for this week.\n"
            },
            {
                "character": "Kenny",
                "line": "(Cartman's ass is so fuckin' huge that they could probably show six stupid films on it and still have some room, heheheheheh) \n"
            },
            {
                "character": "Cartman",
                "line": "Okay, that does it. Screw you guys, I'm going home. \n"
            },
            {
                "character": "Kyle",
                "line": "Well?\n"
            },
            {
                "character": "Cartman",
                "line": "I'm gonna, just give me a minute.\n"
            }
        ],
        [
            {
                "character": "Kyle",
                "line": "You're too fat to be Jesus!\n"
            },
            {
                "character": "Cartman",
                "line": "Oh, and like you're gonna do it, Jew?!\n"
            },
            {
                "character": "Kyle",
                "line": "Stan should be Jesus.\n"
            },
            {
                "character": "Cartman",
                "line": "Either I'm Jesus, or else, screw you guys, I'm going home! \n"
            },
            {
                "character": "Kyle",
                "line": "You're such a fat baby!\n"
            },
            {
                "character": "Cartman",
                "line": "Well, I guess you guys can do the Stations of the Cross by yourselves. \n"
            }
        ],
        [
            {
                "character": "Cartman",
                "line": "What?!\n"
            },
            {
                "character": "Stan",
                "line": "Yeah, dummy, you have to get a nurection.\n"
            },
            {
                "character": "Kyle",
                "line": "Then I can give it to my dad. \n"
            },
            {
                "character": "Cartman",
                "line": "Hey, uh I don't wanna be Jesus anymore! Don't leave me here, you guys! ...All right, that does it! Screw you guys, I'm going home!  Okay, I'm getting pissed now!  God!\n"
            },
            {
                "character": "Mayor McDaniels",
                "line": "All right, people. Scientist Marsh and I have been working very hard on the problem of spontaneous combustion, and we have finally come up with a solution. Mr. Marsh?\n"
            },
            {
                "character": "Randy",
                "line": "The little boy combusted because he had a new girlfriend. It wasn't the girl that caused him to combust, it was the fact that Kenny did not want to pass gas in front of her.  You see, as food is digested the natural processes give off a byproduct known as methane gas.  The methane gathers here in the bowel area , where it causes pressure. Normally a person would expel this byproduct in the form of a pleasant fart.  Should the gas not be expelled,  the methane can build up and then ignite,  leading to... disaster.  Kenny combusted because he held his farts in for too long.\n"
            }
        ],
        [
            {
                "character": "Cartman",
                "line": "No way! Flutes are totally gay!\n"
            },
            {
                "character": "Kenny",
                "line": "(Oh. Flutes are gay?)\n"
            },
            {
                "character": "Stan",
                "line": "Cartman, I'm the leader of the Reenactment Fife and Drum Squad, and I say you play the flute!\n"
            },
            {
                "character": "Cartman",
                "line": "Oh! Well, you know what I say?!  Screw you guys, I'm going home! \n"
            },
            {
                "character": "Kyle",
                "line": "You dick!\n"
            },
            {
                "character": "Cartman",
                "line": "Later.\n"
            }
        ],
        [
            {
                "character": "Kyle",
                "line": "What?\n"
            },
            {
                "character": "Cartman",
                "line": "I've gotta start hanging out with friends that are a little more intelligent, and understand ...politics and stuff. It's just that... I'm up on this level up here , and all my friends are down here .\n"
            },
            {
                "character": "Kyle",
                "line": "You don't know what you're talking about, fatass!\n"
            },
            {
                "character": "Cartman",
                "line": "Nononono! Me h'myah , you guys myah!  — maybe a little mo down, down in hyah.  SCREW YOU GUYS, I'M GOING HOME. \n"
            },
            {
                "character": "Electronic Head",
                "line": "I'm Bill Kurtis.\n"
            },
            {
                "character": "Cartman",
                "line": "I've outgrown all my friends. I need to meet more mature people, Clyde Frog.  Oh, great idea, Clyde Frog!  I can meet new friends on the Internet!  Here's a chat room: \"Men Who Like Young Boys\"  That's perfect.  Hi everybody! I am a young boy seeking an older male for good times. I am eight years old and would li-  Wow! Look at all these guys who wanna be my friend! I'll pick... Tony316.  Hi Tony.  \"So what are you into?\"  Oh, you know, the usual stuff. Smiley-face.  \"Kewl. Wanna get together?  Smiley-face?\"  Sure, Tony! That would be... kewl. Winking, smiley, face.  \"Meet me at Mel's Buffet restaurant tomorrow morning.\"  Sounds good. See you then! Clown hat, curly hair, smiley-face.  You see that, Clyde Frog? Tomorrow I'm gonna meet my first mature friend!\n"
            }
        ],
        [
            {
                "character": "Stan",
                "line": "You don't even know what you're debating about half the time!\n"
            },
            {
                "character": "Cartman",
                "line": "Yes I do!\n"
            },
            {
                "character": "Craig",
                "line": "No you don't!\n"
            },
            {
                "character": "Cartman",
                "line": "Oh yeah?! Well, screw you guys, I'm going home! \n"
            },
            {
                "character": "Kyle",
                "line": "Told ya.\n"
            },
            {
                "character": "Mr. Wyland",
                "line": "Alright, children, well, unlike Mr. Garrison, I want you all to go out and research this debate before we pick teams. Tomorrow, you'll need to choose which side of this poignant debate you are on. \n"
            }
        ],
        [
            {
                "character": "Kyle",
                "line": "Cartman!\n"
            },
            {
                "character": "Cartman",
                "line": "Well, I'm sorry! I have a cold!\n"
            },
            {
                "character": "Stan",
                "line": "That took us half an hour to set up, fatass!\n"
            },
            {
                "character": "Cartman",
                "line": "Alright! You know what? I have been here TOO LONG! I'm sick of making this stupid cartoon, and we're never goin' to finish it anyways!  Screw you guys, I'm goin' home!\n"
            },
            {
                "character": "Kyle",
                "line": "Fine! We'll do it with out you!\n"
            },
            {
                "character": "Stan",
                "line": "We can't do it without him, Kyle. We've already animated him in it!\n"
            }
        ]
    ]
}